# Найти совпадающие элементы двух списков.
# a = [5,[1,2],2,'r',4,'ee']
# b = [4,'we','ee',3,[1,2]]
# Эти значения записать в новый список

a = [5,[1,2],2,'r',4,'ee']
b = [4,'we','ee',3,[1,2]]
c = []
for i in a :
    for u in b :
        if i == u :
            c.append(i)
print(c)
        


