# Сложите цифры пятизначного целого числа.
# from random import *
# n = randint(10000,100000)
# print(n)
# s = [int(x) for x in str(n)]
# print(sum(s))

# Дана строка из двух слов. Поменяйте слова местами.

# s = "Дима Задворный"
# a = s.split()
# b = [a[-1] , a[0]]
# c = " ".join(b)
# print(c)

# С клавиатуры вводится десятизначное число. Вывести на экран четные числа входящие в данное число. Например 1234567892  2 4 6 7 8 2

# n = int(input("Введите 10-значное число   "))
# x = [int(i) for i in str(n)]
# for i in x :
#     if i % 2 == 0 :
#         print(i,end=" ")
#

# С клавиатуры вводится число. Необходимо перевернуть число. Например если ввели 1234 -> 4321

# n = int(input("Введите число   "))
# x = [str(i) for i in str(n)]
# x.reverse()
# c = int("".join(x))
# print(c)












